import React from "react";
import single_article from "../assets/Images/Blogs/single_article.jpg";
import { FaBookmark } from "react-icons/fa";
import GIF_Logo from "../assets/Images/Icons/GIF_Logo.gif";
import { IoArrowRedo, IoArrowUndo } from "react-icons/io5";

const Single_Blog = () => {
  return (
    <section className="text-black text-right" dir="rtl">
      <h1 className="text-5xl font-bold mx-auto w-fit my-6">
        طرق التسويق المبتكرة
      </h1>
      <div className="grid grid-cols-2">
        <div className="2xl:col-span-1 xl:col-span-1 lg:col-span-1 md:col-span-1 col-span-2">
          <img
            src={single_article}
            alt="single_article"
            className=" w-full h-full object-cover"
          />
        </div>
        <p className="bg-[#000] text-white 2xl:col-span-1 xl:col-span-1 lg:col-span-1 md:col-span-1 col-span-2 py-10 px-14 leading-loose text-justify text-2xl">
          طرق التسويق المبتكرة طرق التسويق طرق التسويق المبتكرة طرق طرق التسويق
          المبتكرة طرق التسويق طرق التسويق المبتكرة طرق طرق التسويق المبتكرة طرق
          التسويق طرق التسويق المبتكرة طرق طرق التسويق المبتكرة طرق التسويق طرق
          التسويق المبتكرة طرق
        </p>
      </div>
      <div className="grid grid-cols-12">
        <div className="2xl:col-span-9 xl:col-span-9 lg:col-span-9 md:col-span-7 col-span-12 ">
          <p className="blog-details text-justify px-12 py-6 font-semibold">
            طرق التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرةطرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرةطرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرةطرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة طرق التسويق المبتكرة طرق التسويق المبتكرة طرق
            التسويق المبتكرة
          </p>
          <div className="flex justify-between items-center px-12 my-6 gap-x-5">
            <div className="text-black bg-[#ECECECBD] px-4 py-2 cursor-pointer hover:opacity-80 2xl:text-base lg:text-base md:text-base text-[12px]">
              <div className="flex justify-center items-center  gap-x-1">
                <IoArrowRedo />
                <span className="font-semibold">المقال السابق</span>
              </div>
              <div className="h-[1.5px] bg-black xl:w-[120px] lg:w-[120px] md:w-[120px] w-[80px] mx-auto my-1" />
              <div className="text-center">
                <span className="font-semibold">طرق التسويق المبتكرة</span>
              </div>
            </div>
            <div className="text-black bg-[#ECECECBD] px-4 py-2 cursor-pointer hover:opacity-80  2xl:text-base lg:text-base md:text-base text-[12px]">
              <div className="flex justify-center items-center  gap-x-1">
                <IoArrowUndo />
                <span className="font-semibold">المقال التالي</span>
              </div>
              <div className="h-[1.5px] bg-black xl:w-[120px] lg:w-[120px] md:w-[120px] w-[80px] mx-auto my-1" />
              <div className="text-center">
                <span className="font-semibold">طرق التسويق المبتكرة</span>
              </div>
            </div>
          </div>
        </div>
        <div className="2xl:col-span-3 xl:col-span-3 lg:col-span-3 md:col-span-5 col-span-12">
          <div className="my-10 mx-6">
            <div className="text-main bg-[#000] border-y-[3px] border-main text-[33px] text-center py-4 font-bold px-2">
              محتويات المقالة
            </div>
            <div className="bg-[#ecececbd] text-black font-semibold text-xl p-4 flex flex-col gap-y-4">
              <p>الهوية التجارية</p>
              <p>الهوية المكانية</p>
              <p>الموقع الإلكتروني</p>
              <p>التسويق و الإعلان</p>
            </div>
          </div>
          <div className="my-10 mx-6">
            <div className="text-main bg-[#000] border-y-[3px] border-main text-[33px] text-center py-4 font-bold px-2">
              الخدمات
            </div>
            <div className="bg-[#ecececbd] text-black font-semibold text-xl p-4 flex flex-col gap-y-4">
              <p>الهوية التجارية</p>
              <p>الهوية المكانية</p>
              <p>الموقع الإلكتروني</p>
              <p>التسويق و الإعلان</p>
              <p>التصوير و الإنتاج</p>
              <p>وسائل التواصل الإجتماعي</p>
              <p>الطباعة</p>
              <p>مجالات دعم الصناعة</p>
            </div>
          </div>
          <div className="my-10 mx-6">
            <div className="text-main bg-[#000] border-y-[3px] border-main text-[33px] text-center py-4 font-bold px-2">
              أحدث المقالات
            </div>
            <div className="bg-[#ecececbd] text-black font-semibold text-xl p-4 flex flex-col gap-y-4">
              <p className="flex justify-between items-center">
                <div>الهوية المكانية</div>
                <FaBookmark />
              </p>
              <p className="flex justify-between items-center">
                <div>الهوية المكانية</div>
                <FaBookmark />
              </p>
              <p className="flex justify-between items-center">
                <div>الهوية المكانية</div>
                <FaBookmark />
              </p>
            </div>
          </div>
        </div>
      </div>
      <img src={GIF_Logo} alt="Shooting GIF Logo" className="mt-6 -mb-6" />
    </section>
  );
};

export default Single_Blog;
